## Data tipinin düzəldilməsi

In [1]:
import pandas as pd
import numpy as np
from datetime import datetime

In [2]:
a = ["12", "13", "14", "12", "12"]

In [3]:
b = pd.to_numeric(a)
b.tolist()

[12, 13, 14, 12, 12]

In [4]:
c = np.array([1, 2, 3])
c.astype(str).tolist()

['1', '2', '3']

## Tarix data tipi ilə işləmək

In [5]:
x = "2019-03-21"
y1 = pd.to_datetime(x)
y1

Timestamp('2019-03-21 00:00:00')

In [6]:
type(y1)

pandas._libs.tslibs.timestamps.Timestamp

In [7]:
x = "2019-mar-21"
y2 = pd.to_datetime(x, format="%Y-%b-%d")
y2

Timestamp('2019-03-21 00:00:00')

In [8]:
x = "21-mar-19"
y3 = pd.to_datetime(x, format="%d-%b-%y")
y3

Timestamp('2019-03-21 00:00:00')

In [9]:
x = "21/MAR/19"
y4 = pd.to_datetime(x, format="%d/%b/%y")
y4

Timestamp('2019-03-21 00:00:00')

In [10]:
x = "3.21.2019"
y5 = pd.to_datetime(x, format="%m.%d.%Y")
y5

Timestamp('2019-03-21 00:00:00')

In [11]:
y1 == y2 == y3 == y4 == y5

True

In [12]:
y1.year

2019

In [13]:
y2.day

21

In [14]:
y3.month

3

In [15]:
y4.month_name()

'March'

In [16]:
interval = pd.date_range("2017-11-01", "2018-11-08")
interval

DatetimeIndex(['2017-11-01', '2017-11-02', '2017-11-03', '2017-11-04',
               '2017-11-05', '2017-11-06', '2017-11-07', '2017-11-08',
               '2017-11-09', '2017-11-10',
               ...
               '2018-10-30', '2018-10-31', '2018-11-01', '2018-11-02',
               '2018-11-03', '2018-11-04', '2018-11-05', '2018-11-06',
               '2018-11-07', '2018-11-08'],
              dtype='datetime64[ns]', length=373, freq='D')

In [17]:
day_period = (interval[-1] - interval[0]).days
day_period

372

In [18]:
month_period = (interval[-1] - interval[0]).days // 12
month_period

31

In [19]:
year_period = (interval[-1] - interval[0]).days // 365
year_period

1

## NA’lər ilə işləmək

In [20]:
df = pd.read_csv("startaplar.csv", na_values="")
df.head()

,ID,Name,Industry,Inception,Employees,State,City,Revenue,Expenses,Profit,Growth
0,1,Over-Hex,Software,2006.0,25.0,TN,Franklin,"$9,684,527","1,130,700 Dollars",8553827.0,19%
1,2,Unimattax,IT Services,2009.0,36.0,PA,Newtown Square,"$14,016,543","804,035 Dollars",13212508.0,20%
2,3,Greenfax,Retail,2012.0,NaN,SC,Greenville,"$9,746,272","1,044,375 Dollars",8701897.0,16%
3,4,Blacklane,IT Services,2011.0,66.0,CA,Orange,"$15,359,369","4,631,808 Dollars",10727561.0,19%
4,5,Yearflex,Software,2013.0,45.0,WI,Madison,"$8,567,910","4,374,841 Dollars",4193069.0,19%

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 11 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         500 non-null    int64
 1   Name       500 non-null    object
 2   Industry   498 non-null    object
 3   Inception  499 non-null    float64
 4   Employees  498 non-null    float64
 5   State      496 non-null    object
 6   City       500 non-null    object
 7   Revenue    498 non-null    object
 8   Expenses   497 non-null    object
 9   Profit     498 non-null    float64
 10  Growth     499 non-null    object
dtypes: float64(3), int64(1), object(7)
memory usage: 43.1+ KB

In [22]:
df['ID'] = df['ID'].astype(str)

In [23]:
df['Expenses'] = df['Expenses'].str.replace(" Dollars", "").str.replace(",", "").astype(float)

In [24]:
df['Revenue'] = df['Revenue'].str.replace("[^\d.]", "", regex=True).astype(float)

In [25]:
df['Growth'] = df['Growth'].str.replace("%", "").astype(float)

In [26]:
df.isna().sum()

ID           0
Name         0
Industry     2
Inception    1
Employees    2
State        4
City         0
Revenue      2
Expenses     3
Profit       2
Growth       1
dtype: int64

In [27]:
df[df.isna().any(axis=1)]

,ID,Name,Industry,Inception,Employees,State,City,Revenue,Expenses,Profit,Growth
2,3,Greenfax,Retail,2012.0,NaN,SC,Greenville,9746272.0,1044375.0,8701897.0,16.0
7,8,Rednimdox,Construction,2013.0,73.0,NY,Woodside,NaN,NaN,NaN,NaN
10,11,Canecorporation,Health,2012.0,6.0,NaN,New York,10597009.0,7591189.0,3005820.0,7.0
13,14,Techline,NaN,2006.0,65.0,CA,San Ramon,13898119.0,5470303.0,8427816.0,23.0
14,15,Cityace,NaN,2010.0,25.0,CO,Louisville,9254614.0,6249498.0,3005116.0,6.0
16,17,Ganzlax,IT Services,2011.0,75.0,NJ,Iselin,14001180.0,NaN,11901180.0,18.0
21,22,Lathotline,Health,NaN,103.0,VA,McLean,9418303.0,7567233.0,1851070.0,2.0
43,44,Ganzgreen,Construction,2010.0,224.0,TN,Franklin,NaN,NaN,NaN,9.0
83,84,Drilldrill,Software,2010.0,30.0,NaN,San Francisco,7800620.0,2785799.0,5014821.0,17.0
266,267,Circlechop,Software,2010.0,14.0,NaN,San Francisco,9067070.0,5929828.0,3137242.0,20.0
331,332,Westminster,Financial Services,2010.0,NaN,MI,Troy,11861652.0,5245126.0,6616526.0,15.0
378,379,Stovepuck,Retail,2013.0,73.0,NaN,New York,13814975.0,5904502.0,7910473.0,10.0

In [28]:
df[df['Expenses'].isna()]

,ID,Name,Industry,Inception,Employees,State,City,Revenue,Expenses,Profit,Growth
7,8,Rednimdox,Construction,2013.0,73.0,NY,Woodside,NaN,NaN,NaN,NaN
16,17,Ganzlax,IT Services,2011.0,75.0,NJ,Iselin,14001180.0,NaN,11901180.0,18.0
43,44,Ganzgreen,Construction,2010.0,224.0,TN,Franklin,NaN,NaN,NaN,9.0

In [29]:
df = df[~df['Industry'].isna()]

In [30]:
df.loc[(df['State'].isna()) & (df['City'] == "New York"),]

,ID,Name,Industry,Inception,Employees,State,City,Revenue,Expenses,Profit,Growth
10,11,Canecorporation,Health,2012.0,6.0,NaN,New York,10597009.0,7591189.0,3005820.0,7.0
378,379,Stovepuck,Retail,2013.0,73.0,NaN,New York,13814975.0,5904502.0,7910473.0,10.0

In [31]:
df.loc[(df['State'].isna()) & (df['City'] == "New York"), 'State'] = "NY"

In [32]:
df.loc[(df['State'].isna()) & (df['City'] == "San Francisco"),]

,ID,Name,Industry,Inception,Employees,State,City,Revenue,Expenses,Profit,Growth
83,84,Drilldrill,Software,2010.0,30.0,NaN,San Francisco,7800620.0,2785799.0,5014821.0,17.0
266,267,Circlechop,Software,2010.0,14.0,NaN,San Francisco,9067070.0,5929828.0,3137242.0,20.0

In [33]:
df.loc[(df['State'].isna()) & (df['City'] == "San Francisco"), 'State'] = "CA"

In [34]:
med = df[(df['Industry'] == "Retail") & (df['Inception'] == 2012)]['Employees'].median()
df.loc[(df['Employees'].isna()) & (df['Industry'] == "Retail") & (df['Inception'] == 2012), 'Employees'] = med

In [35]:
med = df[(df['Industry'] == "Financial Services") & (df['Inception'] == 2010)]['Employees'].median()
df.loc[(df['Employees'].isna()) & (df['Industry'] == "Financial Services") & (df['Inception'] == 2010), 'Employees'] = med

In [36]:
med = df[(df['Industry'] == "Construction") & (df['Inception'] == 2013)]['Growth'].median()
df.loc[(df['Growth'].isna()) & (df['Industry'] == "Construction") & (df['Inception'] == 2013), 'Growth'] = med

In [37]:
med = df[(df['Industry'] == "Construction") & (df['Inception'] == 2010)]['Revenue'].median()
df.loc[(df['Revenue'].isna()) & (df['Industry'] == "Construction") & (df['Inception'] == 2010), 'Revenue'] = med

In [38]:
med = df[(df['Industry'] == "Construction") & (df['Inception'] == 2013)]['Revenue'].median()
df.loc[(df['Revenue'].isna()) & (df['Industry'] == "Construction") & (df['Inception'] == 2013), 'Revenue'] = med

In [39]:
med = df[(df['Industry'] == "Construction") & (df['Inception'] == 2010)]['Expenses'].median()
df.loc[(df['Expenses'].isna()) & (df['Industry'] == "Construction") & (df['Inception'] == 2010), 'Expenses'] = med

In [40]:
med = df[(df['Industry'] == "Construction") & (df['Inception'] == 2013)]['Expenses'].median()
df.loc[(df['Expenses'].isna()) & (df['Industry'] == "Construction") & (df['Inception'] == 2013), 'Expenses'] = med

In [41]:
df.loc[df['Profit'].isna(), 'Profit'] = df['Revenue'] - df['Expenses']
df.loc[df['Expenses'].isna(), 'Expenses'] = df['Revenue'] - df['Profit']

In [42]:
df[df.isna().any(axis=1)]

,ID,Name,Industry,Inception,Employees,State,City,Revenue,Expenses,Profit,Growth
21,22,Lathotline,Health,NaN,103.0,VA,McLean,9418303.0,7567233.0,1851070.0,2.0

In [43]:
df['Inception'] = df['Inception'].astype(str)

In [ ]:
mod = df[df['Industry'] == "Health"]['Inception'].mode()
df.loc[(df['Inception'].isna()) & (df['Industry'] == "Health"), 'Inception'] = mod

## Outlier'lər ilə işləmək

In [47]:
num_vars = df.select_dtypes(include = 'number').columns
num_vars

Index(['Employees', 'Revenue', 'Expenses', 'Profit', 'Growth'], dtype='object')

In [48]:
for var in num_vars:
    q1 = df[var].quantile(0.25)
    q3 = df[var].quantile(0.75)
    iqr = q3 - q1
    lower_bound = q1 - 1.5 * iqr
    upper_bound = q3 + 1.5 * iqr
    outliers = df[var][(df[var] < lower_bound) | (df[var] > upper_bound)]
    if not outliers.empty:
        print(f"Outliers in {var}: {outliers.values}")

Outliers in Employees: [ 687.  320.  607.  280.  595.  400.  668.  850.  430. 1628.  545.  485.
  318.  327. 2670.  486.  937.  979.  393. 1500.  285.  308.  489.  335.
  326.  289. 1107.  818. 1442.  372.  425.  539. 1387.  457.  403.  837.
  290.  329.  663.  605.  360.  370. 1600. 1224.  661.  330.  441.  760.
  430.  332.  326.  278.  640.  403.  278.  425.  348.  381.  800.  566.
 7125.]
Outliers in Revenue: [ 1614585. 20252673.  1835717. 21810051.]
Outliers in Profit: [19624534. 18456022.]

In [49]:
for var in num_vars:
    q1 = df[var].quantile(0.25)
    q3 = df[var].quantile(0.75)
    iqr = q3 - q1
    lower_bound = q1 - 1.5 * iqr
    upper_bound = q3 + 1.5 * iqr
    df.loc[df[var] < lower_bound, var] = lower_bound
    df.loc[df[var] > upper_bound, var] = upper_bound

In [50]:
df.isna().sum()

ID           0
Name         0
Industry     0
Inception    0
Employees    0
State        0
City         0
Revenue      0
Expenses     0
Profit       0
Growth       0
dtype: int64